Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s
DO NOT USE! For internal usage only!
Serialization structure for Profile Item properties Enumerator.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.MorePropertiesLeft
More properties to be left for next enumeration.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.IndexToStart
Index to start for this current enumeration.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.nPropertyItems
Number of property items in current enumeration.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.CrossSectionNumber
The cross-section number.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.PropertiesType
The properties type.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.IsParametric
The isParametric flag.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.ProfileName
The name of the profile.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.aProperties
The list of properties.

Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s.ClientId
The client id.